package ru.praktikum.scooter;

public class Locators {
    // Кнопка "Сколько это стоит? И как оплатить?"
    // By.xpath(".//div[contains(text(),'Сколько это стоит')]");

    // Описание при нажатии на кнопку "Сколько это стоит? И как оплатить?"
    //By.xpath(".//p[contains(text(),'Сутки')]");

    // Кнопка "Хочу сразу несколько самокатов! Так можно?"
    // By.xpath(".//div[contains(text(),'Хочу')]");

    // Описание при нажатии на кнопку "Хочу сразу несколько самокатов! Так можно?"
    // By.xpath(".//p[contains(text(),'Пока что у нас так')]");

    // Кнопка "Как рассчитывается время аренды?"
    // By.xpath(".//div[contains(text(),'Как рассчитывается время аренды?')]");

    // Описание при нажатии на кнопку "Как рассчитывается время аренды?"
    // By.xpath(".//p[contains(text(),'Допустим')]");

    // Кнопка "Можно ли заказать самокат прямо на сегодня?"
    // By.xpath(".//div[contains(text(),'прямо на сегодня')]");

    // Описание при нажатии на кнопку "Можно ли заказать самокат прямо на сегодня?"
    // By.xpath(".//p[contains(text(),'с завтрашнего дня')]");

    // Кнопка "Можно ли продлить заказ или вернуть самокат раньше?"
    // By.xpath(".//div[contains(text(),'продлить заказ')]");

    // Описание при нажатии на кнопку "Можно ли продлить заказ или вернуть самокат раньше?"
    // By.xpath(".//p[contains(text(),'Пока что нет')]");

    // Кнопка "Вы привозите зарядку вместе с самокатом?"
    // By.xpath(".//div[contains(text(),'зарядку вместе')]");

    // Описание при нажатии на кнопку "Вы привозите зарядку вместе с самокатом?"
    // By.xpath(".//p[contains(text(),'с полной зарядкой')]");

    // Кнопка "Можно ли отменить заказ?"
    // By.xpath(".//div[contains(text(),'отменить заказ')]");

    // Описание при нажатии на кнопку "Можно ли отменить заказ?"
    // By.xpath(".//p[contains(text(),'пока самокат не привезли')]");

    // Кнопка "Я жизу за МКАДом, привезёте?"
    // By.xpath(".//div[contains(text(),'за МКАДом')]");

    // Описание при нажатии на кнопку "Я жизу за МКАДом, привезёте?"
    // By.xpath(".//p[contains(text(),'Всем самокатов')]");

    // Кнопка "Заказать" в хэдере
    // By.xpath(".//div[@class='Header_Nav__AGCXC']/button[text()='Заказать']");

    // Кнопка "Заказать" в конце страницы
    // By.xpath(".//div[@class='Home_FinishButton__1_cWm']/button[text()='Заказать']");
}
